In [1]:
import file_module as fm

In [2]:
objd = fm.File("data.txt")

In [3]:
objd.read_int_column(0)

[200, 850, 278, 408, 651, 593, 745]

In [4]:
objd.read_int_column(3)

[34, 65, 54, 39, 19, 33, 11]

In [5]:
objd.read_int_column(2)

type of column non integer, written empty list

[]

In [6]:
import pandas as pd

In [9]:
dfa = pd.read_csv("data.txt", sep=" ", header=None)

In [10]:
dfa

     0   1   2   3
0  200  dd  hi  34
1  850  ft  se  65
2  278  go  xt  54
3  408  we  cj  39
4  651  vt  ji  19
5  593  wq  mi  33
6  745  de  xl  11

In [11]:
dfa[0].sum()

3725